import React from 'react'
import {action} from 'mobx'
import {observer} from 'mobx-react'
import Paper from 'material-ui/Paper';

export default class Terms extends React.Component {

	render() {
		return <section className="Terms-page">
			<Paper>
				<h1>פרטיות ותנאי שימוש</h1>
				<h4>מבוא</h4>
				<p>טרם שימושך באתר/מערכת הינך מתבקש לקרוא בעיון את התנאים המפורטים להלן המהווים בסיס משפטי. כל המבצע
					פעולה באתר מסכים כי הינו מודע לתקנון האתר, מדיניות הפרטיות וכללי ההשתתפות באתר וכי לא תהיה לו ו/או
					למי מטעמו כל טענה ותביעה כנגד בעלי, עובדי ונציגי בית העסק. במידה ואינך מסכימ/ה לתנאי השימוש, כולם או
					חלקם, הנך מתבקש שלא לעשות כל שימוש באתר.</p>
				<p>בעצם השימוש במערכת (השארת פרטים) מאשר המשתמש שימוש בפרטיו ע"פ תנאי הפרטיות המפורטים בהמשך מסמך זה.
					לביטול הסכמה זו יש לפנות בסמס חוזר, מייל חוזר או למשרדי בית העסק בבקשה לביטול הסכמה זו ולחדול מקבלת
					עדכונים ודברי פרסומת. במקרה של ביטול לא ימסרו עדכונים לגבי מצב ההזמנה, תזכורות, משובים והטבות.
				</p>
				<h4>הטבות ופיצויים</h4>
				<p>במסגרת השירותים באתר, המשתמש יוכל לקבל הטבות ופיצויים. מימוש ההטבה באופן וכפי שמפורט בהטבה עצמה.
					מימוש ההטבות יהא אפשרי בהצגת ו/או בשימוש הטבות תקפות בלבד ועל פי תנאי ההטבה. איננו נושאים באחריות,
					בין במישרין ובין בעקיפין, לרבות בנוגע לאופן מימושם, תוקפם, איכותם והתאמתם לפרסום באתר או לצרכי
					הגולש.
					בית העסק אינו אחראי ולא יהיה אחראי לכל טענה בדבר אי נכונות ו/או אי דיוק ו/או פגמים בפרטים שנמסרו על
					ידי המשתמש בעת ביצוע הזמנת השירות ו/או לגבי פרטים שלא נקלטו במערכת המחשב של החברה ולכל נזק, חיסרון
					כיס, לגבי שגיאות בהטבה או באופן ומימושה ולגבי כל טענה אחרת בקשר עם ביצוע משלוח ו/או הזמנה.
					בית העסק שומר לעצמו את הזכות להשעות, לבטל או לסרב לספק את השירות ו/או הטבה מסוימת אשר נמסרה ללקוח,
					וזאת על פי שיקול דעתו הבלעדי ומבלי למסור הודעה על כך מראש.
				</p>
				<h4>פרטיות</h4>
				מדיניות הפרטיות חלה על הנתונים
				<ul>
					<li>נתונים הנמסרים כחלק מתהליך ההרשמה לאתר או במסגרת הצטרפות למועדון לקוחות.</li>
					<li>על התכנים והמידע המועברים על ידי המשתמשים בזמן השימוש באתר</li>
					<li>ידע שנאסף אודות המשתמשים בזמן הגלישה באתר ("מידע על הגולש").</li>
				</ul>
				הנתונים שתמסרו ישמרו במאגר המידע של החברה.
				<p>בית העסק יהא רשאי לנהוג במאגר המידע בהתאם להוראות הדין ולעשות במאגר המידע שימוש, בין היתר, לצורך
					דיוור מידע ותכנים אליכם (בדואר ו/או בדואר אלקטרוני ו/או סמס).</p>
				<p>בכל עת תוכלו לפנות לבית העסק בכתב ולבקש להסיר את הנתונים ממאגר המידע, אולם חשוב לזכור כי לאחר הסרת
					הנתונים לא תוכלו לעשות שימוש בפעילויות ובשירותים הטעונים הרשמה.</p>
				<p>בית העסק יימנע ככל האפשר מלמסור את הנתונים שלכם לצדדים שלישיים, אלא במקרים בהם ימצא בית העסק כי איזו
					מפעולותיכם באתר מפרות את תנאי השימוש, או נעשו לשם ביצוע תרמית מכל סוג שהוא, או אם הוא יהיה מחויב
					לעשות כן על פי צו שיפוטי או אם יעמוד בפני איום שיינקטו כנגדה צעדים משפטיים (פליליים או אזרחיים) בגין
					פעולות שביצעתם באתר. במקרים אלו רשאי למסור את פרטיכם לצד הטוען כי נפגע מכם או בהתאם להוראות צו
					שיפוטי.</p>
				<p>בית העסק רשאית להשתמש במידע על הגולש לצורך שיפור האתר, השירותים והתכנים שהוא מציע, לצורכי יצירת קשר
					איתכם או לצורך ניתוח ומסירת מידע סטטיסטי לצדדים שלישיים, לרבות מפרסמים. המשתמש במערכת מסכים ומאשר,
					בעצם השימוש במערכת, כי בית העסק יהא רשאי לשמור במאגריו את הפרטים שנמסרו על-ידו ומידע נוסף שיצטבר
					אודותיו, לשם ביצוע, מעת לעת, פעולות כגון, יצירת קשר עימו, פרסום, מתן שירותי דיוור, על ידי החברה ו/או
					מי מטעמה ו/או גורמים אחרים, איסוף מידע אודותיו ושימוש בו, לרבות אחסונו, העברתו ושיתופו, על ידי החברה
					ו/או מי מטעמה ו/או גורמים אחרים, למטרות סטטיסטיות ו/או לעשיית עסקאות מכל סוג עם לקוחות וצדדים
					שלישיים, ולצרכים מסחריים אחרים, זאת ללא תשלום כל תמורה.</p>
				<p>בית העסק רשאי לשלוח אליכם מדי פעם בסמס מידע פרסומי - בין אם מידע שהוא עצמו יפרסם ובין אם מידע שתקבלו
					לצורך משלוח מידי מפרסמים אחרים.</p>
				<p>אין בית העסק יכול להתחייב בפני המשתמשים כי לא תתאפשר חדירה בלתי חוקית למאגרי המידע הכלולים באתר.</p>
				<p>האתר מעמיד לרשות משתמשיו אפשרות להשארת פרטי קשר לקבלת עדכונים והטבות. אלא אם צוין אחרת, מסירת פרטיך
					באמצעות הטופס מעידה על הסכמתך המפורשת לקבלת דברי פרסומת מהנהלת האתר ו/או מי מטעמה, כמשמעות הסכמה זו
					בהוראות סעיף 30א לחוק התקשורת (בזק ושידורים), התשמ"ב – 1982. דברי הפרסומת ישלחו אליך לפי המידע שמסרת
					להנהלת האתר בטופס המקוון, באמצעות מספר הטלפון שמסרת. בכל עת, תוכל לחזור בך מהסכמתך ולהודיע להנהלת
					האתר על סירוב לקבלת דברי פרסומת, דרך כלל או מסוג מסוים, על-ידי משלוח הודעת סירוב.</p>
				<p>ידוע למשתמש באתר שהמידע שמסר עשוי לשמש למטרות שיווק כולל למשלוח פרסומת באמצעות סמס, וטלפון וכן למטרות
					דיוור ישיר, השתתפות בסקרים ושירותים נוספים. הגופים יהיו רשאים להעביר את המידע לצדדים שלישיים וכן
					להוסיף למידע מידע ממקורות אחרים ידוע למשתמש כי הדיוור הישיר ו/או הפרסום עשוי לכלול דברי פרסומת של
					צדדים שלישיים שאינם בהכרח החברה, והוא נותן את הסכמתו מדעת לקבלת דברי פרסום אלה במסגרת הדיוור
					הישיר/פרסום.</p>
				<p>בעשותך שימוש באתר במסגרת מסירת תכנים לפרסום באתר, לרבות פרסום המלצות, חלה עליך האחריות המלאה והבלעדית
					לכל תוצאה אשר עשויה לנבוע מכך ועליך להימנע מלפרסם בו: (1) תכנים שהעלאתם ו/או תוכנם בלתי חוקיים ו/או
					נועדו למטרות בלתי חוקיות ו/או הפוגעים בפעילות המערכת; (2) תכנים בעלי אופי גזעני, פוגעני ו/או שיש
					בפרסומם משום לשון הרע ו/או עבירה על חוק כלשהו; (3) תכנים העלולים לפגוע ו/או להזיק ברגשות הציבור,
					לרבות כל תוכן בעל אופי מעליב, משמיץ, טורדני או פוגע העלול לפגוע ברגשות הציבור; (4) כל תוכן העלול
					להוות בסיס לקובלנה פלילית ו/או תביעה אזרחית או מהווה הפרה של כל חוק ישראלי, לרבות תוכן בלתי חוקי
					ו/או תוכן המעודד, מסייע או מנחה בביצוע מעשה המהווה עבירה פלילית ו/או עוולה נזיקית לפי דיני מדינת
					ישראל; (5) כל תוכן הפוגע ו/או עלול לפגוע בשם הטוב של צד שלישי; (6) כל תוכן העלול להוות הטעייה ו/או
					כל תוכן הידוע למשתמש כשקרי, מטעה או מסולף; (7) תכנים הפוגעים בפרטיות; (8) תכנים אשר זכויות הקניין
					הרוחני בהם אינן שייכות לך; (9) תכנים בעלי אופי מסחרי ו/או המכילים מידע פרסומי כלשהו; (10) כל תוכן
					המזהה אישית אנשים אחרים, מבלי שנתנו את הסכמתם לפרסום זהותם ו/או (11) תכנים אשר מכילים וירוסי מחשב
					מכל סוג שהוא. יובהר כי החברה רשאית שלא לפרסם ו/או להסיר כל תוכן אשר כולל אחד או יותר מהסעיפים
					האמורים.</p>
				<h4>ברירת דין ומקום שיפוט</h4>
				<p>התנאים המובאים לעיל ולהלן פרשנותם ואכיפתם נשלטים על ידי חוקי מדינת ישראל בלבד. כל הפעולות המתבצעות
					באמצעות אתר זה הנן כפופות לדין הישראלי בלבד וכל הליך משפטי בגין כל עילה שמקורה בפעולה משפטית שהתבצעה
					באתר זה יתברר בבית המשפט המוסמך במחוז תל אביב בלבד.</p>
			</Paper>
		</section>
	}
}